app/views/books/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]
---
    <i class="fa fa-heart" aria-hidden="true" style="color: red;"></i>
    <%= @book.favorites.count %> いいね

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]
---
    <i class="fa fa-heart-o" aria-hidden="true"></i>
    <%= @book.favorites.count %> いいね

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]
---
     <td>
         <p>コメント数<%= @book.book_comments.count %></p>