app/controllers/books_controller.rb

	def create
        @user = current_user
		@book = Book.new(book_params)
        @book.user_id = (current_user.id)
	    if @book.save
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "aaaaa"], ["body", "bbbbbbbbbb"], ["user_id", 1], ["created_at", "2020-07-09 07:48:42.211535"], ["updated_at", "2020-07-09 07:48:42.211535"]]

    def show
        @user = current_user
    	@book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def index
        @user = current_user
        @books = Book.all
---
SELECT "books".* FROM "books"